{"20231224040449/v1":{"title":"Predictive Modeling of Blood Pressure Categories: Integrating Demographic and Dietary Factors for Personalized Management","subject":"Data Science (Applications)","license":"CC BY-NC-SA","predecessor":null,"successor":null,"submissionDate":"2023/12/24","keywords":["blood pressure","multinomial regression","lasso","tree","gradient boosting","xgboost","R"],"author":[{"firstName":"Li","lastName":"Yuan","orcid":"0009-0008-1075-9922"}],"abstract":"This study delves into predictive modeling of blood pressure categories, focusing on the United States, addressing the global health concern of hypertension. Mainly utilizing demographic and dietary data from the CDC National Health and Nutrition Examination Survey (NHANES) 2017-2018, aims to craft personalized management strategies. Drawing on research emphasizing the multifaceted determinants of hypertension, we leverage the multinomial regression model with lasso regularization as a baseline. Furthermore, the study advances to the extreme gradient boosting (XGB) algorithm, achieving a slightly better performance than multinomial regression. Evaluation metrics include accuracy and Area Under the Curve (AUC) in a 10-fold cross-validation framework. The study provides possible personal blood pressure management solution.","relatedPublishment":{"name":"PREPRINTS.RU","url":"https://preprints.ru/article/1216/"},"relatedLink":"https://bpmodel.ly.gd.edu.kg/","submitterID":"user_2so35E0TC4NHXAlQhQuJPswIJSD"},"20231224041118/v1":{"title":"California 2022 Proposition 30 Feasibility Report and Recommendations","subject":"Data Science (Applications)","license":"CC BY-NC-SA","predecessor":null,"successor":null,"submissionDate":"2023/12/24","keywords":["politics","public policy","wildfire","electric car","R"],"author":[{"firstName":"Weilin","lastName":"Cheng"},{"firstName":"Hengyuan","lastName":"Liu","orcid":"0009-0007-3162-2071"},{"firstName":"Kathy","lastName":"Mo","orcid":"0009-0007-8456-5656"},{"firstName":"Li","lastName":"Yuan","orcid":"0009-0008-1075-9922"}],"abstract":"Proposition 30 is a plan in California to increase taxes on high-income earners in order to fund programs that promote the use of zero-emission vehicles and prevent wildfires. The tax is expected to start in 2023 and end by 2043, or earlier if the state is able to maintain its greenhouse gas emissions at expected levels for three consecutive years. Proposition 30 plans to use 80% of the tax revenue to fund the Zero Emission Vehicle program, with 45% dedicated to helping people buy electric vehicles and 35% to installing charging stations. The remaining 20% will be used for Wildfire Response and Prevention Programs. The goal is to help California reduce its greenhouse gas emissions and meet its target of reducing emissions to 80% below 1990 levels by 2050. The authors conducted a study that evaluates whether the proposition can help California achieve its goal.","relatedLink":"https://caelection2022.gd.edu.kg/","comment":"UC Davis California Election 2022 Data Challenge.","submitterID":"user_2so35E0TC4NHXAlQhQuJPswIJSD"},"20231224042259/v1":{"title":"2022 - 2023 H5N1 Bird Flu Modeling and Prediction in the United States","subject":"Data Science (Applications)","license":"CC BY","predecessor":null,"successor":null,"submissionDate":"2023/12/24","keywords":["H5N1","logistic regression","ridge regression","lasso regression","glmnet","R"],"author":[{"firstName":"Weilin","lastName":"Cheng"},{"firstName":"Hengyuan","lastName":"Liu","orcid":"0009-0007-3162-2071"},{"firstName":"Kathy","lastName":"Mo","orcid":"0009-0007-8456-5656"},{"firstName":"Sida","lastName":"Tian","orcid":"0009-0007-7056-2876"},{"firstName":"Li","lastName":"Yuan","orcid":"0009-0008-1075-9922"}],"abstract":"This report presents an analysis of the likelihood of H5N1 outbreaks in different counties of the United States in January 2023 using logistic regression, ridge regression, and lasso regression models. The models were trained using historical data from 2022, and the accuracy of the models in predicting H5N1 outbreaks in January 2023 is about 98.4%. The lasso regression model performed the best among the three models, with an AUC of 0.8015. The map generated based on the lasso regression model indicated that counties in the north and west were at a higher risk of having H5N1 outbreaks in January 2023, which matched the actual result. The report concludes that there are limitations to the models, including the consideration of only a limited set of factors affecting the spread of the virus and the use of historical data. Future work could incorporate additional data sources and use more sophisticated machine learning techniques to improve the accuracy of the models. The report also proposes some possible remedies to help control the spread of H5N1.","relatedLink":"https://h5n1.gd.edu.kg/","comment":"IASC Data Analysis Competition 2023.","submitterID":"user_2so35E0TC4NHXAlQhQuJPswIJSD"},"20231224043044/v1":{"title":"Analysis of Shot Marilyns by Andy Warhol","subject":"Computer Science (Computer Vision and Pattern Recognition)","license":"CC BY","predecessor":null,"successor":null,"submissionDate":"2023/12/24","keywords":["shot marilyns","marilyn monroe","andy warhol","python"],"author":[{"firstName":"Hengyuan","lastName":"Liu","orcid":"0009-0007-3162-2071"},{"firstName":"Xinhui","lastName":"Luo"},{"firstName":"Weilin","lastName":"Cheng"},{"firstName":"Erick S.","lastName":"Arenas V."}],"abstract":"This paper explores the differences and commons between five different versions of Shot Marilyns done by Andy Warhol. We conducted a comprehensive analysis of color composition and distribution in a set of art pieces. Using various methods such as relative conditional entropy, we explored the distinct color distributions and correlations within each image. By clustering the images and examining specific regions of interest (ROIs), including backgrounds, hair, eyeshadow, and face, we gained detailed insights into the construction and differences of each image. We also observed that initial expectations of uniform colors for certain elements were not met, highlighting the complexity and deceptive nature of color perception in art.","submitterID":"user_2spvYQ9AjrISg3WoP6dprXUp6F6"},"20240914190729/v1":{"title":"NYC Newborn Analysis 2011-2019","subject":"Data Science (Applications)","license":"CC BY","predecessor":null,"successor":null,"submissionDate":"2024/09/14","keywords":["Logistic Regression","Decision Tree","Python"],"author":[{"firstName":"Hengyuan","lastName":"Liu","orcid":"0009-0007-3162-2071"},{"firstName":"Nathan","lastName":"Lam"},{"firstName":"Timothy","lastName":"Tu"},{"firstName":"Urata","lastName":"Yuki"},{"firstName":"Shun","lastName":"Yao"},{"firstName":"Kahyun","lastName":"Jo"}],"abstract":"The population of baby names has names come and go, and some have evolved. We wanted to see if we could predict sex based on ethnicity and name characteristics to see how these influences shift a name’s sex. The dataset we used was publicly available data from the city of New York containing the top 75 most popular names for each sex and ethnic category for each year from 2011-2019. Through our analysis on the dataset in regard to sex, we saw that there was a high correlation between name endings with a vowel and sex, where female names were 10 times more likely to end with a vowel. Other factors, such as ethnicity, the amount of syllables in the name, the length of the name, and whether the name started with a vowel had statistically significant but small correlation with sex.","submitterID":"user_2spvYQ9AjrISg3WoP6dprXUp6F6"},"20241229182247/v1":{"title":"Student Future Academic Performance after Being Placed on Dean’s List","subject":"Economics (Econometrics)","license":"CC BY","predecessor":null,"successor":null,"submissionDate":"2024/12/29","keywords":["Dean’s List","Future Academic Performance","Regression discontinuity design","Econometrics"],"author":[{"firstName":"Luc","lastName":"Chen"}],"abstract":"This study examines the causal impact of being placed on the Dean&#39;s List, a positive education incentive, on future student performance using a regression discontinuity design. The results suggest that for students with low prior academic performance and who are native English speakers, there is a positive impact of being on the Dean’s List on the probability of getting onto the Dean&#39;s List in the following year. However, being on the Dean&#39;s List does not appear to have a statistically significant effect on subsequent GPA, total credits taken, dropout rates, or the probability of graduating within four years. These findings suggest that a place on the Dean&#39;s List may not be a strong motivator for students to improve their academic performance and achieve better outcomes.","submitterID":"user_2so35E0TC4NHXAlQhQuJPswIJSD"},"20241230073542/v1":{"title":"Curriculum Learning For Autonomous Vehicles","subject":"Data Science (Machine Learning)","license":"CC BY","predecessor":null,"successor":null,"submissionDate":"2024/12/30","keywords":["Reinforcement learning (RL)","Curriculum Learning","Autonomous Vehicles","MDP","Reward Function"],"author":[{"firstName":"Luc","lastName":"Chen"},{"firstName":"Michelle","lastName":"Chang"},{"firstName":"Theo","lastName":"Lebryk"}],"abstract":"This study investigates how the sequence of training environments affects performance in simple driving tasks for an autonomous driving agent. By training agents solely through interaction with maps of varying difficulty, we demonstrate that transfer learning enhances performance within single-environment driving scenarios. However, we find that agents struggle to master advanced driving capabilities and fail to generalize well to new environments, regardless of the sequence of training data. We conclude by looking at areas to build on this work such by combining imitation learning with curriculum learning and developing curriculum-specific MDP.","submitterID":"user_2so35E0TC4NHXAlQhQuJPswIJSD"},"20241230074419/v1":{"title":"Data Efficient Dense Cross-Lingual Information Retrieval","subject":"Computer Science (Computation and Language)","license":"CC BY","predecessor":null,"successor":null,"submissionDate":"2024/12/30","keywords":["LLMs","Cross-Lingual Information Retrieval (CIR)","Translation"],"author":[{"firstName":"Luc","lastName":"Chen"},{"firstName":"Yinan","lastName":"He"},{"firstName":"Alayna","lastName":"Nguyen"}],"abstract":"Cross-Lingual Information Retrieval (CIR) remains challenging due to limited annotated data and linguistic diversity, especially for low-resource languages. While dense retrieval models have significantly advanced retrieval performance, their reliance on large-scale training datasets hampers their effectiveness in multilingual settings. In this work, we propose two complementary strategies to improve data efficiency and robustness in CIR model fine- tuning. First, we introduce a paraphrase-based query augmentation pipeline leveraging large language models (LLMs) to enrich scarce training data, thereby promoting more robust and language-agnostic representations. Second, we present a weighted InfoNCE loss that emphasizes underrepresented languages, ensuring balanced optimization across heterogeneous linguistic inputs. Experiments on cross-lingual benchmark datasets demonstrate that our combined approaches yield substantial gains in retrieval quality, outperforming standard training protocols on small and imbalanced datasets. These results underscore the potential of targeted data augmentation and reweighted objectives to build more inclusive and effective CIR systems, even under resource constraints.","submitterID":"user_2so35E0TC4NHXAlQhQuJPswIJSD"}}
