{
  "20231224042259/v1": {
    "title": "2022 - 2023 H5N1 Bird Flu Modeling and Prediction in the United States",
    "subject": "Data Science (Applications)",
    "license": "CC BY",
    "predecessor": null,
    "successor": null,
    "submissionDate": "2023/12/24",
    "keywords": [
      "H5N1",
      "logistic regression",
      "ridge regression",
      "lasso regression",
      "glmnet",
      "R"
    ],
    "author": [
      {
        "firstName": "Weilin",
        "lastName": "Cheng"
      },
      {
        "firstName": "Hengyuan",
        "lastName": "Liu",
        "orcid": "0009-0007-3162-2071"
      },
      {
        "firstName": "Kathy",
        "lastName": "Mo",
        "orcid": "0009-0007-8456-5656"
      },
      {
        "firstName": "Sida",
        "lastName": "Tian",
        "orcid": "0009-0007-7056-2876"
      },
      {
        "firstName": "Li",
        "lastName": "Yuan",
        "orcid": "0009-0008-1075-9922"
      }
    ],
    "abstract": "This report presents an analysis of the likelihood of H5N1 outbreaks in different counties of the United States in January 2023 using logistic regression, ridge regression, and lasso regression models. The models were trained using historical data from 2022, and the accuracy of the models in predicting H5N1 outbreaks in January 2023 is about 98.4%. The lasso regression model performed the best among the three models, with an AUC of 0.8015. The map generated based on the lasso regression model indicated that counties in the north and west were at a higher risk of having H5N1 outbreaks in January 2023, which matched the actual result. The report concludes that there are limitations to the models, including the consideration of only a limited set of factors affecting the spread of the virus and the use of historical data. Future work could incorporate additional data sources and use more sophisticated machine learning techniques to improve the accuracy of the models. The report also proposes some possible remedies to help control the spread of H5N1.",
    "relatedLink": "https://h5n1.gd.edu.kg/",
    "comment": "IASC Data Analysis Competition 2023.",
    "submitterID": "user_2so35E0TC4NHXAlQhQuJPswIJSD"
  }
}