{
  "20231224042259/v1": {
    "title": "2022 - 2023 H5N1 Bird Flu Modeling and Prediction in the United States",
    "subject": "Data Science (Applications)",
    "license": "CC BY",
    "predecessor": null,
    "successor": "20231224042259/v2",
    "submissionDate": "2023/12/24",
    "keywords": [
      "H5N1",
      "logistic regression",
      "ridge regression",
      "lasso regression",
      "glmnet",
      "R"
    ],
    "author": [
      {
        "firstName": "Weilin",
        "lastName": "Cheng"
      },
      {
        "firstName": "Hengyuan",
        "lastName": "Liu",
        "orcid": "0009-0007-3162-2071"
      },
      {
        "firstName": "Kathy",
        "lastName": "Mo",
        "orcid": "0009-0007-8456-5656"
      },
      {
        "firstName": "Sida",
        "lastName": "Tian",
        "orcid": "0009-0007-7056-2876"
      },
      {
        "firstName": "Li",
        "lastName": "Yuan",
        "orcid": "0009-0008-1075-9922"
      }
    ],
    "abstract": "This report presents an analysis of the likelihood of H5N1 outbreaks in different counties of the United States in January 2023 using logistic regression, ridge regression, and lasso regression models. The models were trained using historical data from 2022, and the accuracy of the models in predicting H5N1 outbreaks in January 2023 is about 98.4%. The lasso regression model performed the best among the three models, with an AUC of 0.8015. The map generated based on the lasso regression model indicated that counties in the north and west were at a higher risk of having H5N1 outbreaks in January 2023, which matched the actual result. The report concludes that there are limitations to the models, including the consideration of only a limited set of factors affecting the spread of the virus and the use of historical data. Future work could incorporate additional data sources and use more sophisticated machine learning techniques to improve the accuracy of the models. The report also proposes some possible remedies to help control the spread of H5N1.",
    "relatedLink": "https://h5n1.gd.edu.kg/",
    "comment": "IASC Data Analysis Competition 2023.",
    "submitterID": "user_2so35E0TC4NHXAlQhQuJPswIJSD"
  },
  "20231224042259/v2": {
    "title": "2022 - 2023 H5N1 Bird Flu Modeling and Prediction in the United States",
    "subject": "Data Science (Applications)",
    "license": "CC BY-SA",
    "predecessor": "20231224042259/v1",
    "successor": "20231224042259/v3",
    "submissionDate": "2023/12/25",
    "keywords": [
      "H5N1",
      "logistic regression",
      "ridge regression",
      "lasso regression",
      "glmnet",
      "R"
    ],
    "author": [
      {
        "firstName": "Weilin",
        "lastName": "Cheng"
      },
      {
        "firstName": "Hengyuan",
        "lastName": "Liu",
        "orcid": "0009-0007-3162-2071"
      },
      {
        "firstName": "Kathy",
        "lastName": "Mo",
        "orcid": "0009-0007-8456-5656"
      },
      {
        "firstName": "Sida",
        "lastName": "Tian",
        "orcid": "0009-0007-7056-2876"
      },
      {
        "firstName": "Li",
        "lastName": "Yuan",
        "orcid": "0009-0008-1075-9922"
      }
    ],
    "abstract": "This report presents an analysis of the likelihood of H5N1 outbreaks in different counties of the United States in March 2023 using logistic regression, ridge regression, lasso regression, ridge &amp; lasso regression models. The models were trained using historical data from January 2022 to March 2023, and the accuracy of the models in predicting H5N1 outbreaks in March 2023 is about 99.348%. The ridge &amp; lasso regression model performed the best among the four models, with an AUC of 0.7959950. The map generated based on the ridge &amp; lasso regression model indicated that counties in the north and west were at a higher risk of having H5N1 outbreaks in March 2023, which matched the actual result. The report concludes that there are limitations to the models, including the consideration of only a limited set of factors affecting the spread of the virus and the use of historical data. Future work could incorporate additional data sources and use more sophisticated machine learning techniques to improve the accuracy of the models. The report also proposes some possible remedies to help control the spread of H5N1.",
    "relatedLink": "https://h5n1.gd.edu.kg/",
    "submitterID": "user_2so35E0TC4NHXAlQhQuJPswIJSD"
  },
  "20231224042259/v3": {
    "title": "Predictive Modeling of H5N1 Bird Flu in United States of America: A 2022-2023 Analysis",
    "subject": "Data Science (Applications)",
    "license": "CC BY-SA",
    "predecessor": "20231224042259/v2",
    "successor": null,
    "submissionDate": "2023/12/25",
    "keywords": [
      "H5N1",
      "avian influenza",
      "risk assessment",
      "classification",
      "regularization",
      "xgboost",
      "R"
    ],
    "author": [
      {
        "firstName": "Weilin",
        "lastName": "Cheng"
      },
      {
        "firstName": "Hengyuan",
        "lastName": "Liu",
        "orcid": "0009-0007-3162-2071"
      },
      {
        "firstName": "Kathy",
        "lastName": "Mo",
        "orcid": "0009-0007-8456-5656"
      },
      {
        "firstName": "Sida",
        "lastName": "Tian",
        "orcid": "0009-0007-7056-2876"
      },
      {
        "firstName": "Li",
        "lastName": "Yuan",
        "orcid": "0009-0008-1075-9922"
      }
    ],
    "abstract": "This research uniquely focuses on predicting the likelihood of H5N1 outbreaks in the United States at the county level. Unlike previous studies, which either excluded the United States or used outdated data, we utilized diverse statistical techniques and publicly available H5N1-related data from January 2022 to March 2023. Employing logistic regression, regularization methods, cross-validation, and eXtreme Gradient Boosting (XGBoost), our models demonstrated remarkable predictive efficacy. Notably, the XGBoost model, trained with 10-fold cross-validation, outperformed others in terms of ROC-AUC. This research provides valuable epidemiological insights, proposes intervention strategies for H5N1 in the United States, and suggests future research directions.",
    "relatedLink": "https://h5n1.gd.edu.kg/",
    "submitterID": "user_2so35E0TC4NHXAlQhQuJPswIJSD"
  }
}