{
  "20241229182247/v1": {
    "title": "Student Future Academic Performance after Being Placed on Dean’s List",
    "subject": "Economics (Econometrics)",
    "license": "CC BY",
    "predecessor": null,
    "successor": "20241229182247/v2",
    "submissionDate": "2024/12/29",
    "keywords": [
      "Dean’s List",
      "Future Academic Performance",
      "Regression discontinuity design",
      "Econometrics"
    ],
    "author": [
      {
        "firstName": "Luc",
        "lastName": "Chen"
      }
    ],
    "abstract": "This study examines the causal impact of being placed on the Dean&#39;s List, a positive education incentive, on future student performance using a regression discontinuity design. The results suggest that for students with low prior academic performance and who are native English speakers, there is a positive impact of being on the Dean’s List on the probability of getting onto the Dean&#39;s List in the following year. However, being on the Dean&#39;s List does not appear to have a statistically significant effect on subsequent GPA, total credits taken, dropout rates, or the probability of graduating within four years. These findings suggest that a place on the Dean&#39;s List may not be a strong motivator for students to improve their academic performance and achieve better outcomes.",
    "submitterID": "user_2t0ErseSoa6F6ihrk6Hrvx7GI2z"
  },
  "20241229182247/v2": {
    "title": "The Causal Impact of Dean’s List Recognition on  Academic Performance: Evidence from a  Regression Discontinuity Design",
    "subject": "Economics (Econometrics)",
    "license": "CC BY",
    "predecessor": "20241229182247/v1",
    "successor": null,
    "submissionDate": "2025/01/05",
    "keywords": [
      "Dean’s List",
      "Future Academic Performance",
      "Regression discontinuity design",
      "Econometrics"
    ],
    "author": [
      {
        "firstName": "Luc",
        "lastName": "Chen"
      }
    ],
    "abstract": "This study examines the causal impact of being placed on the Dean’s List, a positive education incentive, on future student performance using a regression discontinuity design. The results suggest that for students with low prior academic performance and who are native English speakers, there is a positive impact of being on the Dean’s List on the probability of getting onto the Dean’s List in the following year. However, being on the Dean’s List does not appear to have a statistically significant effect on subsequent GPA, total credits taken, dropout rates, or the probability of graduating within four years. These findings suggest that a place on the Dean’s List may not be a strong motivator for students to improve their academic performance and achieve better outcomes.",
    "relatedPublishment": {
      "name": "arXiv",
      "url": "https://arxiv.org/abs/2501.09763"
    },
    "submitterID": "user_2t0ErseSoa6F6ihrk6Hrvx7GI2z"
  }
}
